xml/Documents/ДвижениеСредств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Document>
		<Properties>
			<Name>ДвижениеСредств</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccountingRegister.Личный</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетКт</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Личный</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДт</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Личный</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаВал</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Курс</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СубконтоДт</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Вид</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ВидыСубконто</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконто</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СубконтоКт</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Вид</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ВидыСубконто</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконто</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

xml/Documents/ДвижениеСредств/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаСервере
Процедура СчетКтПриИзмененииНаСервере(ПоказыватьВалюту)
	РаботаСФормамиВызовСервера.ЗаполнитьТаблицуСубконто(Объект.СчетКт, Объект.СубконтоКт);
	ПоказыватьВалюту = НужноПоказатьВалюту();
КонецПроцедуры


&НаКлиенте
Процедура СчетКтПриИзменении(Элемент)
	ПоказыватьВалюту = Ложь;	
	СчетКтПриИзмененииНаСервере(ПоказыватьВалюту);
	УстановитьВидимостьТЧ(Элементы.СубконтоКт, Объект.СубконтоКт.Количество());
	ПоказатьВалюту(ПоказыватьВалюту);
КонецПроцедуры


&НаСервере
Процедура СчетДтПриИзмененииНаСервере(ПоказыватьВалюту)
	РаботаСФормамиВызовСервера.ЗаполнитьТаблицуСубконто(Объект.СчетДт, Объект.СубконтоДт);
	ПоказыватьВалюту = НужноПоказатьВалюту();
КонецПроцедуры


&НаКлиенте
Процедура СчетДтПриИзменении(Элемент)
	ПоказыватьВалюту = Ложь;	
	СчетДтПриИзмененииНаСервере(ПоказыватьВалюту);
	УстановитьВидимостьТЧ(Элементы.СубконтоДт, Объект.СубконтоДт.Количество());
	ПоказатьВалюту(ПоказыватьВалюту);
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимостьТЧ(ЭлементТЧ, КоличествоСтрок)

	Если КоличествоСтрок>0 Тогда
		ЭлементТЧ.Видимость=Истина;
	КонецЕсли; 

КонецПроцедуры

&НаКлиенте
Процедура ПоказатьВалюту(Показать)
	
	Элементы.ГруппаОбмен.Видимость = Показать;
	//Элементы.СуммаВал.Видимость = Показать;
	//Элементы.Курс.Видимость = Показать;

КонецПроцедуры
 

&НаСервере
Функция НужноПоказатьВалюту()
	Если Объект.СчетКт.Пустая() ИЛИ Объект.СчетДт.Пустая() Тогда
	
		Возврат Ложь;	
	
	Иначе
	
		Возврат НЕ Объект.СчетКт.Валюта=Объект.СчетДт.Валюта;	
		
	КонецЕсли; 
	 
КонецФункции // НужноАктивироватьВалюту()

&НаКлиенте
Процедура СуммаВалПриИзменении(Элемент)
	ОбновитьКурс();
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьКурс()

	Если Объект.Сумма<>0 И Объект.СуммаВал<>0 Тогда
		
		Объект.Курс = Объект.Сумма / Объект.СуммаВал;
		
	КонецЕсли; 	

КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// Валюта
	Элементы.ГруппаОбмен.Видимость = НужноПоказатьВалюту();
	// СубконтоДт
	Если Объект.СубконтоДт.Количество()>0 Тогда
		Элементы.СубконтоДт.Видимость=Истина;
	Иначе	
		Элементы.СубконтоДт.Видимость=Ложь;
	КонецЕсли;
	// СубконтоКт
	Если Объект.СубконтоКт.Количество()>0 Тогда
		Элементы.СубконтоКт.Видимость=Истина;
	Иначе	
		Элементы.СубконтоКт.Видимость=Ложь;
	КонецЕсли; 

КонецПроцедуры
 

//&НаСервере
//Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
//	Если Объект.СчетКт = Объект.СчетДт Тогда
//	
//		Отказ=Истина;
//		
//		Сообщение = Новый СообщениеПользователю;
//		Сообщение.Текст = "Счета одинаковые";
//		Сообщение.Поле = "СчетКт";
//		Сообщение.УстановитьДанные(ЭтотОбъект);
//		Сообщение.Сообщить(); 
//	
//	КонецЕсли; 
//КонецПроцедуры
